Revit 2024 API
DoubleParameterValue Constructor (Double)
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public DoubleParameterValue(
	double value
)
Visual Basic
Public Sub New ( _
	value As Double _
)
Visual C++
public:
DoubleParameterValue(
	double value
)
Parameters
value
Type: System.Double
See Also
DoubleParameterValue Class
DoubleParameterValue Overload
Autodesk.Revit.DB Namespace